package lesson21;

public class Main {
    public static void main(String[] args) {
        //модіфікатори static та final
        // final - це означає що константа
        // static - можно звертатись до елементів класса не створюючи обʼєкти класса

        int x = Math.summ(2,3); //для виклику summ створення обʼєкта не потрібно тому що вказано static

        Math.x = 24;  // визов без створення обʼєкту
        // статичні обʼєкти змінюють своє значення для всіє обєктів належащих до классу
        System.out.println(x);
        // Math.mult(2, 3); //так викликати не можно тому що не статік

       Math a = new Math();
       a.mult(2, 3); // для виклику a потрібно створення обʼєкту

        Math b = new Math();
        System.out.println(b.y); //виведемо значення 12 яке було присвоєно в классі
        b.y = 24; // назначемо нове значення
        System.out.println(b.y); // виведемо це значення

        Math z = new Math(); //створемо новий обʼєк
        System.out.println(z.y); // очикуємо що він буде теж рівнятись 12 але ні, т.я y static а ми перепризначили значення на 24

    }
}
