package lesson12;

public class Main {
    public static void main(String[] args) {
        // 4 принципи ООП
        //абстракція - викидуємо все що не являється загальною характеристикою, загальні зарактеристики записуються у клас та потім використовуються для обʼєктів
        // не треба нагружати класс зайвим - це абстракція
        //інкапсуляція - защіта характеристик методів полів (public, privet, protected)
        //наслідування - наслідування усіх методів із іншого класуe
        //поліморфізм - метод рабоать може буди поширен через на різні види

    }
}
